app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 17 Nov 2013 20:37:56 UTC +00:00], ["text", "Hi there"], ["title", "Hello world"], ["updated_at", Sun, 17 Nov 2013 20:37:56 UTC +00:00]]
---
	def create
    @post = Post.new(params[:post].permit(:title, :text))

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 5  [["text", "World and welcome to Rails!"], ["updated_at", Sun, 17 Nov 2013 21:47:28 UTC +00:00]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))